var xValues = ['5 Окт', '6 Окт', '7 Окт', '8 Окт', '9 Окт', '10 Окт', '11 Окт', '12 Окт', '13 Окт', '14 Окт', '15 Окт', '16 Окт', '17 Окт', '18 Окт', '19 Окт', '20 Окт', '21 Окт', '22 Окт', '23 Окт', '24 Окт', '25 Окт', '26 Окт', '27 Окт', '28 Окт', '29 Окт', '30 Окт', '31 Окт', '1 Нояб', '2 Нояб', '3 Нояб', '4 Нояб', '5 Нояб', ];

new Chart("myChart", {
    type: "line",
    data: {
        labels: xValues,
        datasets: [{
            data: [200, 190, 150, 130, 93, 50, 42, 20, 5, 200, 190, 150, 130, 93, 50, 213, 170, 138, 100, 200, 190, 150, 130, 93, 50, 213, 170, 138, 100, 93, 50, 42],
            borderColor: "red",
            fill: false
        }, {
            data: [56, 92, 65, 40, 90, 17, 70, 88, 45, 66, 50, 50, 120, 80, 62, 55, 44, 60, 30, 48, 90, 48, 63, 78, 25, 14, 15, 56, 88, 52, 77, 38, 50],
            borderColor: "green",
            fill: false
        }, {
            data: [36, 5, 30, 86, 50, 50, 120, 80, 62, 100, 48, 125, 26, 30, 86, 50, 50, 120, 80, 62, 100, 48, 63, 78, 25, 14, 96, 33, 56, 58, 100],
            borderColor: "blue",
            fill: false
        }]
    },
    options: {
        legend: {
            display: false
        }
    }
});